Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/include/proc/p32mz1064dah176.h
extern volatile __I2C2CONbits_t I2C2CONbits __asm__ ("I2C2CON") __attribute__((section("sfrs"), address(0xBF820200)));
extern volatile uint32_t        I2C2CONCLR __attribute__((section("sfrs"),address(0xBF820204)));
extern volatile uint32_t        I2C2CONSET __attribute__((section("sfrs"),address(0xBF820208)));
extern volatile uint32_t        I2C2CONINV __attribute__((section("sfrs"),address(0xBF82020C)));
#define I2C2STAT I2C2STAT
extern volatile uint32_t   I2C2STAT __attribute__((section("sfrs"), address(0xBF820210)));
typedef union {
  struct {
    uint32_t TBF:1;
    uint32_t RBF:1;
    uint32_t R_W:1;
    uint32_t S:1;
    uint32_t P:1;
    uint32_t D_A:1;
    uint32_t I2COV:1;
    uint32_t IWCOL:1;
    uint32_t ADD10:1;
    uint32_t GCSTAT:1;
    uint32_t BCL:1;
    uint32_t :2;
    uint32_t ACKTIM:1;
    uint32_t TRSTAT:1;
    uint32_t ACKSTAT:1;
  };
  struct {
    uint32_t :6;
    uint32_t I2CPOV:1;
  };
} __I2C2STATbits_t;
extern volatile __I2C2STATbits_t I2C2STATbits __asm__ ("I2C2STAT") __attribute__((section("sfrs"), address(0xBF820210)));
extern volatile uint32_t        I2C2STATCLR __attribute__((section("sfrs"),address(0xBF820214)));
extern volatile uint32_t        I2C2STATSET __attribute__((section("sfrs"),address(0xBF820218)));
extern volatile uint32_t        I2C2STATINV __attribute__((section("sfrs"),address(0xBF82021C)));
#define I2C2ADD I2C2ADD
extern volatile uint32_t   I2C2ADD __attribute__((section("sfrs"), address(0xBF820220)));
typedef struct {
  uint32_t I2CADD:10;
} __I2C2ADDbits_t;
extern volatile __I2C2ADDbits_t I2C2ADDbits __asm__ ("I2C2ADD") __attribute__((section("sfrs"), address(0xBF820220)));
extern volatile uint32_t        I2C2ADDCLR __attribute__((section("sfrs"),address(0xBF820224)));
extern volatile uint32_t        I2C2ADDSET __attribute__((section("sfrs"),address(0xBF820228)));
extern volatile uint32_t        I2C2ADDINV __attribute__((section("sfrs"),address(0xBF82022C)));
#define I2C2MSK I2C2MSK
extern volatile uint32_t   I2C2MSK __attribute__((section("sfrs"), address(0xBF820230)));
typedef union {
  struct {
    uint32_t I2CMSK:10;
  };
  struct {
    uint32_t AMSK:10;
  };
} __I2C2MSKbits_t;
extern volatile __I2C2MSKbits_t I2C2MSKbits __asm__ ("I2C2MSK") __attribute__((section("sfrs"), address(0xBF820230)));
extern volatile uint32_t        I2C2MSKCLR __attribute__((section("sfrs"),address(0xBF820234)));
extern volatile uint32_t        I2C2MSKSET __attribute__((section("sfrs"),address(0xBF820238)));
extern volatile uint32_t        I2C2MSKINV __attribute__((section("sfrs"),address(0xBF82023C)));
#define I2C2BRG I2C2BRG
extern volatile uint32_t   I2C2BRG __attribute__((section("sfrs"), address(0xBF820240)));
typedef struct {
  uint32_t I2CBRG:16;
} __I2C2BRGbits_t;
extern volatile __I2C2BRGbits_t I2C2BRGbits __asm__ ("I2C2BRG") __attribute__((section("sfrs"), address(0xBF820240)));
extern volatile uint32_t        I2C2BRGCLR __attribute__((section("sfrs"),address(0xBF820244)));
extern volatile uint32_t        I2C2BRGSET __attribute__((section("sfrs"),address(0xBF820248)));
extern volatile uint32_t        I2C2BRGINV __attribute__((section("sfrs"),address(0xBF82024C)));
#define I2C2TRN I2C2TRN
extern volatile uint32_t   I2C2TRN __attribute__((section("sfrs"), address(0xBF820250)));
typedef struct {
  uint32_t I2CTRN:8;
} __I2C2TRNbits_t;
extern volatile __I2C2TRNbits_t I2C2TRNbits __asm__ ("I2C2TRN") __attribute__((section("sfrs"), address(0xBF820250)));
extern volatile uint32_t        I2C2TRNCLR __attribute__((section("sfrs"),address(0xBF820254)));
extern volatile uint32_t        I2C2TRNSET __attribute__((section("sfrs"),address(0xBF820258)));
extern volatile uint32_t        I2C2TRNINV __attribute__((section("sfrs"),address(0xBF82025C)));
#define I2C2RCV I2C2RCV
extern volatile uint32_t   I2C2RCV __attribute__((section("sfrs"), address(0xBF820260)));
typedef struct {
  uint32_t I2CRCV:8;
} __I2C2RCVbits_t;
extern volatile __I2C2RCVbits_t I2C2RCVbits __asm__ ("I2C2RCV") __attribute__((section("sfrs"), address(0xBF820260)));
extern volatile uint32_t        I2C2RCVCLR __attribute__((section("sfrs"),address(0xBF820264)));
extern volatile uint32_t        I2C2RCVSET __attribute__((section("sfrs"),address(0xBF820268)));
extern volatile uint32_t        I2C2RCVINV __attribute__((section("sfrs"),address(0xBF82026C)));
#define I2C3CON I2C3CON
extern volatile uint32_t   I2C3CON __attribute__((section("sfrs"), address(0xBF820400)));
typedef union {
  struct {
    uint32_t SEN:1;
    uint32_t RSEN:1;
    uint32_t PEN:1;
    uint32_t RCEN:1;
    uint32_t ACKEN:1;
    uint32_t ACKDT:1;
    uint32_t STREN:1;
    uint32_t GCEN:1;
    uint32_t SMEN:1;
    uint32_t DISSLW:1;
    uint32_t A10M:1;
    uint32_t STRICT:1;
    uint32_t SCLREL:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t DHEN:1;
    uint32_t AHEN:1;
    uint32_t SBCDE:1;
    uint32_t SDAHT:1;
    uint32_t BOEN:1;
    uint32_t SCIE:1;
    uint32_t PCIE:1;
  };
  struct {
    uint32_t :11;
    uint32_t IPMIEN:1;
    uint32_t :1;
    uint32_t I2CSIDL:1;
    uint32_t :1;
    uint32_t I2CEN:1;
  };
} __I2C3CONbits_t;
extern volatile __I2C3CONbits_t I2C3CONbits __asm__ ("I2C3CON") __attribute__((section("sfrs"), address(0xBF820400)));
extern volatile uint32_t        I2C3CONCLR __attribute__((section("sfrs"),address(0xBF820404)));
extern volatile uint32_t        I2C3CONSET __attribute__((section("sfrs"),address(0xBF820408)));
extern volatile uint32_t        I2C3CONINV __attribute__((section("sfrs"),address(0xBF82040C)));
#define I2C3STAT I2C3STAT
extern volatile uint32_t   I2C3STAT __attribute__((section("sfrs"), address(0xBF820410)));
typedef union {
  struct {
    uint32_t TBF:1;
    uint32_t RBF:1;
    uint32_t R_W:1;
    uint32_t S:1;
    uint32_t P:1;
    uint32_t D_A:1;
    uint32_t I2COV:1;
    uint32_t IWCOL:1;
    uint32_t ADD10:1;
    uint32_t GCSTAT:1;
    uint32_t BCL:1;
    uint32_t :2;
    uint32_t ACKTIM:1;
    uint32_t TRSTAT:1;
    uint32_t ACKSTAT:1;
  };
  struct {
    uint32_t :6;
    uint32_t I2CPOV:1;
  };
} __I2C3STATbits_t;
extern volatile __I2C3STATbits_t I2C3STATbits __asm__ ("I2C3STAT") __attribute__((section("sfrs"), address(0xBF820410)));
extern volatile uint32_t        I2C3STATCLR __attribute__((section("sfrs"),address(0xBF820414)));
extern volatile uint32_t        I2C3STATSET __attribute__((section("sfrs"),address(0xBF820418)));
extern volatile uint32_t        I2C3STATINV __attribute__((section("sfrs"),address(0xBF82041C)));
#define I2C3ADD I2C3ADD
extern volatile uint32_t   I2C3ADD __attribute__((section("sfrs"), address(0xBF820420)));
typedef struct {
  uint32_t I2CADD:10;
} __I2C3ADDbits_t;
extern volatile __I2C3ADDbits_t I2C3ADDbits __asm__ ("I2C3ADD") __attribute__((section("sfrs"), address(0xBF820420)));
extern volatile uint32_t        I2C3ADDCLR __attribute__((section("sfrs"),address(0xBF820424)));
extern volatile uint32_t        I2C3ADDSET __attribute__((section("sfrs"),address(0xBF820428)));
extern volatile uint32_t        I2C3ADDINV __attribute__((section("sfrs"),address(0xBF82042C)));
#define I2C3MSK I2C3MSK
extern volatile uint32_t   I2C3MSK __attribute__((section("sfrs"), address(0xBF820430)));
typedef union {
  struct {
    uint32_t I2CMSK:10;
  };
  struct {
    uint32_t AMSK:10;
  };
} __I2C3MSKbits_t;
