Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/include/proc/p32mz1064dah176.h
extern volatile __SPI3CONbits_t SPI3CONbits __asm__ ("SPI3CON") __attribute__((section("sfrs"), address(0xBF821400)));
extern volatile uint32_t        SPI3CONCLR __attribute__((section("sfrs"),address(0xBF821404)));
extern volatile uint32_t        SPI3CONSET __attribute__((section("sfrs"),address(0xBF821408)));
extern volatile uint32_t        SPI3CONINV __attribute__((section("sfrs"),address(0xBF82140C)));
#define SPI3STAT SPI3STAT
extern volatile uint32_t   SPI3STAT __attribute__((section("sfrs"), address(0xBF821410)));
typedef union {
  struct {
    uint32_t SPIRBF:1;
    uint32_t SPITBF:1;
    uint32_t :1;
    uint32_t SPITBE:1;
    uint32_t :1;
    uint32_t SPIRBE:1;
    uint32_t SPIROV:1;
    uint32_t SRMT:1;
    uint32_t SPITUR:1;
    uint32_t :2;
    uint32_t SPIBUSY:1;
    uint32_t FRMERR:1;
    uint32_t :3;
    uint32_t TXBUFELM:5;
    uint32_t :3;
    uint32_t RXBUFELM:5;
  };
  struct {
    uint32_t w:32;
  };
} __SPI3STATbits_t;
extern volatile __SPI3STATbits_t SPI3STATbits __asm__ ("SPI3STAT") __attribute__((section("sfrs"), address(0xBF821410)));
extern volatile uint32_t        SPI3STATCLR __attribute__((section("sfrs"),address(0xBF821414)));
extern volatile uint32_t        SPI3STATSET __attribute__((section("sfrs"),address(0xBF821418)));
extern volatile uint32_t        SPI3STATINV __attribute__((section("sfrs"),address(0xBF82141C)));
#define SPI3BUF SPI3BUF
extern volatile uint32_t   SPI3BUF __attribute__((section("sfrs"), address(0xBF821420)));
#define SPI3BRG SPI3BRG
extern volatile uint32_t   SPI3BRG __attribute__((section("sfrs"), address(0xBF821430)));
extern volatile uint32_t        SPI3BRGCLR __attribute__((section("sfrs"),address(0xBF821434)));
extern volatile uint32_t        SPI3BRGSET __attribute__((section("sfrs"),address(0xBF821438)));
extern volatile uint32_t        SPI3BRGINV __attribute__((section("sfrs"),address(0xBF82143C)));
#define SPI3CON2 SPI3CON2
extern volatile uint32_t   SPI3CON2 __attribute__((section("sfrs"), address(0xBF821440)));
typedef union {
  struct {
    uint32_t AUDMOD:2;
    uint32_t :1;
    uint32_t AUDMONO:1;
    uint32_t :3;
    uint32_t AUDEN:1;
    uint32_t IGNTUR:1;
    uint32_t IGNROV:1;
    uint32_t SPITUREN:1;
    uint32_t SPIROVEN:1;
    uint32_t FRMERREN:1;
    uint32_t :2;
    uint32_t SPISGNEXT:1;
  };
  struct {
    uint32_t AUDMOD0:1;
    uint32_t AUDMOD1:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI3CON2bits_t;
extern volatile __SPI3CON2bits_t SPI3CON2bits __asm__ ("SPI3CON2") __attribute__((section("sfrs"), address(0xBF821440)));
extern volatile uint32_t        SPI3CON2CLR __attribute__((section("sfrs"),address(0xBF821444)));
extern volatile uint32_t        SPI3CON2SET __attribute__((section("sfrs"),address(0xBF821448)));
extern volatile uint32_t        SPI3CON2INV __attribute__((section("sfrs"),address(0xBF82144C)));
#define SPI4CON SPI4CON
extern volatile uint32_t   SPI4CON __attribute__((section("sfrs"), address(0xBF821600)));
typedef union {
  struct {
    uint32_t SRXISEL:2;
    uint32_t STXISEL:2;
    uint32_t DISSDI:1;
    uint32_t MSTEN:1;
    uint32_t CKP:1;
    uint32_t SSEN:1;
    uint32_t CKE:1;
    uint32_t SMP:1;
    uint32_t MODE16:1;
    uint32_t MODE32:1;
    uint32_t DISSDO:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t ENHBUF:1;
    uint32_t SPIFE:1;
    uint32_t :5;
    uint32_t MCLKSEL:1;
    uint32_t FRMCNT:3;
    uint32_t FRMSYPW:1;
    uint32_t MSSEN:1;
    uint32_t FRMPOL:1;
    uint32_t FRMSYNC:1;
    uint32_t FRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI4CONbits_t;
extern volatile __SPI4CONbits_t SPI4CONbits __asm__ ("SPI4CON") __attribute__((section("sfrs"), address(0xBF821600)));
extern volatile uint32_t        SPI4CONCLR __attribute__((section("sfrs"),address(0xBF821604)));
extern volatile uint32_t        SPI4CONSET __attribute__((section("sfrs"),address(0xBF821608)));
extern volatile uint32_t        SPI4CONINV __attribute__((section("sfrs"),address(0xBF82160C)));
#define SPI4STAT SPI4STAT
extern volatile uint32_t   SPI4STAT __attribute__((section("sfrs"), address(0xBF821610)));
typedef union {
  struct {
    uint32_t SPIRBF:1;
    uint32_t SPITBF:1;
    uint32_t :1;
    uint32_t SPITBE:1;
    uint32_t :1;
    uint32_t SPIRBE:1;
    uint32_t SPIROV:1;
    uint32_t SRMT:1;
    uint32_t SPITUR:1;
    uint32_t :2;
    uint32_t SPIBUSY:1;
    uint32_t FRMERR:1;
    uint32_t :3;
    uint32_t TXBUFELM:5;
    uint32_t :3;
    uint32_t RXBUFELM:5;
  };
  struct {
    uint32_t w:32;
  };
} __SPI4STATbits_t;
extern volatile __SPI4STATbits_t SPI4STATbits __asm__ ("SPI4STAT") __attribute__((section("sfrs"), address(0xBF821610)));
extern volatile uint32_t        SPI4STATCLR __attribute__((section("sfrs"),address(0xBF821614)));
extern volatile uint32_t        SPI4STATSET __attribute__((section("sfrs"),address(0xBF821618)));
extern volatile uint32_t        SPI4STATINV __attribute__((section("sfrs"),address(0xBF82161C)));
#define SPI4BUF SPI4BUF
extern volatile uint32_t   SPI4BUF __attribute__((section("sfrs"), address(0xBF821620)));
#define SPI4BRG SPI4BRG
extern volatile uint32_t   SPI4BRG __attribute__((section("sfrs"), address(0xBF821630)));
extern volatile uint32_t        SPI4BRGCLR __attribute__((section("sfrs"),address(0xBF821634)));
extern volatile uint32_t        SPI4BRGSET __attribute__((section("sfrs"),address(0xBF821638)));
extern volatile uint32_t        SPI4BRGINV __attribute__((section("sfrs"),address(0xBF82163C)));
#define SPI4CON2 SPI4CON2
extern volatile uint32_t   SPI4CON2 __attribute__((section("sfrs"), address(0xBF821640)));
typedef union {
  struct {
    uint32_t AUDMOD:2;
    uint32_t :1;
    uint32_t AUDMONO:1;
    uint32_t :3;
    uint32_t AUDEN:1;
    uint32_t IGNTUR:1;
    uint32_t IGNROV:1;
    uint32_t SPITUREN:1;
    uint32_t SPIROVEN:1;
    uint32_t FRMERREN:1;
    uint32_t :2;
    uint32_t SPISGNEXT:1;
  };
  struct {
    uint32_t AUDMOD0:1;
    uint32_t AUDMOD1:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI4CON2bits_t;
extern volatile __SPI4CON2bits_t SPI4CON2bits __asm__ ("SPI4CON2") __attribute__((section("sfrs"), address(0xBF821640)));
extern volatile uint32_t        SPI4CON2CLR __attribute__((section("sfrs"),address(0xBF821644)));
extern volatile uint32_t        SPI4CON2SET __attribute__((section("sfrs"),address(0xBF821648)));
extern volatile uint32_t        SPI4CON2INV __attribute__((section("sfrs"),address(0xBF82164C)));
#define SPI5CON SPI5CON
extern volatile uint32_t   SPI5CON __attribute__((section("sfrs"), address(0xBF821800)));
typedef union {
  struct {
    uint32_t SRXISEL:2;
    uint32_t STXISEL:2;
    uint32_t DISSDI:1;
    uint32_t MSTEN:1;
    uint32_t CKP:1;
    uint32_t SSEN:1;
    uint32_t CKE:1;
    uint32_t SMP:1;
    uint32_t MODE16:1;
    uint32_t MODE32:1;
    uint32_t DISSDO:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t ENHBUF:1;
    uint32_t SPIFE:1;
    uint32_t :5;
    uint32_t MCLKSEL:1;
    uint32_t FRMCNT:3;
    uint32_t FRMSYPW:1;
    uint32_t MSSEN:1;
    uint32_t FRMPOL:1;
    uint32_t FRMSYNC:1;
    uint32_t FRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI5CONbits_t;
