Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/include/proc/p32mz1064dah176.h
extern volatile __IC1CONbits_t IC1CONbits __asm__ ("IC1CON") __attribute__((section("sfrs"), address(0xBF842000)));
extern volatile uint32_t        IC1CONCLR __attribute__((section("sfrs"),address(0xBF842004)));
extern volatile uint32_t        IC1CONSET __attribute__((section("sfrs"),address(0xBF842008)));
extern volatile uint32_t        IC1CONINV __attribute__((section("sfrs"),address(0xBF84200C)));
#define IC1BUF IC1BUF
extern volatile uint32_t   IC1BUF __attribute__((section("sfrs"), address(0xBF842010)));
#define IC2CON IC2CON
extern volatile uint32_t   IC2CON __attribute__((section("sfrs"), address(0xBF842200)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC2CONbits_t;
extern volatile __IC2CONbits_t IC2CONbits __asm__ ("IC2CON") __attribute__((section("sfrs"), address(0xBF842200)));
extern volatile uint32_t        IC2CONCLR __attribute__((section("sfrs"),address(0xBF842204)));
extern volatile uint32_t        IC2CONSET __attribute__((section("sfrs"),address(0xBF842208)));
extern volatile uint32_t        IC2CONINV __attribute__((section("sfrs"),address(0xBF84220C)));
#define IC2BUF IC2BUF
extern volatile uint32_t   IC2BUF __attribute__((section("sfrs"), address(0xBF842210)));
#define IC3CON IC3CON
extern volatile uint32_t   IC3CON __attribute__((section("sfrs"), address(0xBF842400)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC3CONbits_t;
extern volatile __IC3CONbits_t IC3CONbits __asm__ ("IC3CON") __attribute__((section("sfrs"), address(0xBF842400)));
extern volatile uint32_t        IC3CONCLR __attribute__((section("sfrs"),address(0xBF842404)));
extern volatile uint32_t        IC3CONSET __attribute__((section("sfrs"),address(0xBF842408)));
extern volatile uint32_t        IC3CONINV __attribute__((section("sfrs"),address(0xBF84240C)));
#define IC3BUF IC3BUF
extern volatile uint32_t   IC3BUF __attribute__((section("sfrs"), address(0xBF842410)));
#define IC4CON IC4CON
extern volatile uint32_t   IC4CON __attribute__((section("sfrs"), address(0xBF842600)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC4CONbits_t;
extern volatile __IC4CONbits_t IC4CONbits __asm__ ("IC4CON") __attribute__((section("sfrs"), address(0xBF842600)));
extern volatile uint32_t        IC4CONCLR __attribute__((section("sfrs"),address(0xBF842604)));
extern volatile uint32_t        IC4CONSET __attribute__((section("sfrs"),address(0xBF842608)));
extern volatile uint32_t        IC4CONINV __attribute__((section("sfrs"),address(0xBF84260C)));
#define IC4BUF IC4BUF
extern volatile uint32_t   IC4BUF __attribute__((section("sfrs"), address(0xBF842610)));
#define IC5CON IC5CON
extern volatile uint32_t   IC5CON __attribute__((section("sfrs"), address(0xBF842800)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC5CONbits_t;
extern volatile __IC5CONbits_t IC5CONbits __asm__ ("IC5CON") __attribute__((section("sfrs"), address(0xBF842800)));
extern volatile uint32_t        IC5CONCLR __attribute__((section("sfrs"),address(0xBF842804)));
extern volatile uint32_t        IC5CONSET __attribute__((section("sfrs"),address(0xBF842808)));
extern volatile uint32_t        IC5CONINV __attribute__((section("sfrs"),address(0xBF84280C)));
#define IC5BUF IC5BUF
extern volatile uint32_t   IC5BUF __attribute__((section("sfrs"), address(0xBF842810)));
#define IC6CON IC6CON
extern volatile uint32_t   IC6CON __attribute__((section("sfrs"), address(0xBF842A00)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC6CONbits_t;
extern volatile __IC6CONbits_t IC6CONbits __asm__ ("IC6CON") __attribute__((section("sfrs"), address(0xBF842A00)));
extern volatile uint32_t        IC6CONCLR __attribute__((section("sfrs"),address(0xBF842A04)));
extern volatile uint32_t        IC6CONSET __attribute__((section("sfrs"),address(0xBF842A08)));
extern volatile uint32_t        IC6CONINV __attribute__((section("sfrs"),address(0xBF842A0C)));
#define IC6BUF IC6BUF
extern volatile uint32_t   IC6BUF __attribute__((section("sfrs"), address(0xBF842A10)));
#define IC7CON IC7CON
extern volatile uint32_t   IC7CON __attribute__((section("sfrs"), address(0xBF842C00)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC7CONbits_t;
extern volatile __IC7CONbits_t IC7CONbits __asm__ ("IC7CON") __attribute__((section("sfrs"), address(0xBF842C00)));
extern volatile uint32_t        IC7CONCLR __attribute__((section("sfrs"),address(0xBF842C04)));
extern volatile uint32_t        IC7CONSET __attribute__((section("sfrs"),address(0xBF842C08)));
extern volatile uint32_t        IC7CONINV __attribute__((section("sfrs"),address(0xBF842C0C)));
#define IC7BUF IC7BUF
extern volatile uint32_t   IC7BUF __attribute__((section("sfrs"), address(0xBF842C10)));
#define IC8CON IC8CON
extern volatile uint32_t   IC8CON __attribute__((section("sfrs"), address(0xBF842E00)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC8CONbits_t;
extern volatile __IC8CONbits_t IC8CONbits __asm__ ("IC8CON") __attribute__((section("sfrs"), address(0xBF842E00)));
extern volatile uint32_t        IC8CONCLR __attribute__((section("sfrs"),address(0xBF842E04)));
extern volatile uint32_t        IC8CONSET __attribute__((section("sfrs"),address(0xBF842E08)));
extern volatile uint32_t        IC8CONINV __attribute__((section("sfrs"),address(0xBF842E0C)));
#define IC8BUF IC8BUF
extern volatile uint32_t   IC8BUF __attribute__((section("sfrs"), address(0xBF842E10)));
#define IC9CON IC9CON
extern volatile uint32_t   IC9CON __attribute__((section("sfrs"), address(0xBF843000)));
typedef union {
  struct {
    uint32_t ICM:3;
    uint32_t ICBNE:1;
    uint32_t ICOV:1;
    uint32_t ICI:2;
    uint32_t ICTMR:1;
    uint32_t C32:1;
    uint32_t FEDGE:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t ICM0:1;
    uint32_t ICM1:1;
    uint32_t ICM2:1;
    uint32_t :2;
    uint32_t ICI0:1;
    uint32_t ICI1:1;
  };
  struct {
    uint32_t :13;
    uint32_t ICSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __IC9CONbits_t;
extern volatile __IC9CONbits_t IC9CONbits __asm__ ("IC9CON") __attribute__((section("sfrs"), address(0xBF843000)));
extern volatile uint32_t        IC9CONCLR __attribute__((section("sfrs"),address(0xBF843004)));
extern volatile uint32_t        IC9CONSET __attribute__((section("sfrs"),address(0xBF843008)));
extern volatile uint32_t        IC9CONINV __attribute__((section("sfrs"),address(0xBF84300C)));
#define IC9BUF IC9BUF
extern volatile uint32_t   IC9BUF __attribute__((section("sfrs"), address(0xBF843010)));
#define OC1CON OC1CON
extern volatile uint32_t   OC1CON __attribute__((section("sfrs"), address(0xBF844000)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC1CONbits_t;
extern volatile __OC1CONbits_t OC1CONbits __asm__ ("OC1CON") __attribute__((section("sfrs"), address(0xBF844000)));
extern volatile uint32_t        OC1CONCLR __attribute__((section("sfrs"),address(0xBF844004)));
extern volatile uint32_t        OC1CONSET __attribute__((section("sfrs"),address(0xBF844008)));
extern volatile uint32_t        OC1CONINV __attribute__((section("sfrs"),address(0xBF84400C)));
#define OC1R OC1R
extern volatile uint32_t   OC1R __attribute__((section("sfrs"), address(0xBF844010)));
extern volatile uint32_t        OC1RCLR __attribute__((section("sfrs"),address(0xBF844014)));
extern volatile uint32_t        OC1RSET __attribute__((section("sfrs"),address(0xBF844018)));
extern volatile uint32_t        OC1RINV __attribute__((section("sfrs"),address(0xBF84401C)));
#define OC1RS OC1RS
extern volatile uint32_t   OC1RS __attribute__((section("sfrs"), address(0xBF844020)));
extern volatile uint32_t        OC1RSCLR __attribute__((section("sfrs"),address(0xBF844024)));
extern volatile uint32_t        OC1RSSET __attribute__((section("sfrs"),address(0xBF844028)));
extern volatile uint32_t        OC1RSINV __attribute__((section("sfrs"),address(0xBF84402C)));
#define OC2CON OC2CON
extern volatile uint32_t   OC2CON __attribute__((section("sfrs"), address(0xBF844200)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC2CONbits_t;
