Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/include/proc/p32mz1064dah176.h
extern volatile __GLCDCURDATA21bits_t GLCDCURDATA21bits __asm__ ("GLCDCURDATA21") __attribute__((section("sfrs"), address(0xBF8EA854)));
#define GLCDCURDATA22 GLCDCURDATA22
extern volatile uint32_t   GLCDCURDATA22 __attribute__((section("sfrs"), address(0xBF8EA858)));
typedef struct {
  uint32_t PIXEL523:4;
  uint32_t PIXEL522:4;
  uint32_t PIXEL521:4;
  uint32_t PIXEL520:4;
  uint32_t PIXEL519:4;
  uint32_t PIXEL518:4;
  uint32_t PIXEL517:4;
  uint32_t PIXEL516:4;
} __GLCDCURDATA22bits_t;
extern volatile __GLCDCURDATA22bits_t GLCDCURDATA22bits __asm__ ("GLCDCURDATA22") __attribute__((section("sfrs"), address(0xBF8EA858)));
#define GLCDCURDATA23 GLCDCURDATA23
extern volatile uint32_t   GLCDCURDATA23 __attribute__((section("sfrs"), address(0xBF8EA85C)));
typedef struct {
  uint32_t PIXEL531:4;
  uint32_t PIXEL530:4;
  uint32_t PIXEL529:4;
  uint32_t PIXEL528:4;
  uint32_t PIXEL527:4;
  uint32_t PIXEL526:4;
  uint32_t PIXEL525:4;
  uint32_t PIXEL524:4;
} __GLCDCURDATA23bits_t;
extern volatile __GLCDCURDATA23bits_t GLCDCURDATA23bits __asm__ ("GLCDCURDATA23") __attribute__((section("sfrs"), address(0xBF8EA85C)));
#define GLCDCURDATA24 GLCDCURDATA24
extern volatile uint32_t   GLCDCURDATA24 __attribute__((section("sfrs"), address(0xBF8EA860)));
typedef struct {
  uint32_t PIXEL67:4;
  uint32_t PIXEL66:4;
  uint32_t PIXEL65:4;
  uint32_t PIXEL64:4;
  uint32_t PIXEL63:4;
  uint32_t PIXEL62:4;
  uint32_t PIXEL61:4;
  uint32_t PIXEL60:4;
} __GLCDCURDATA24bits_t;
extern volatile __GLCDCURDATA24bits_t GLCDCURDATA24bits __asm__ ("GLCDCURDATA24") __attribute__((section("sfrs"), address(0xBF8EA860)));
#define GLCDCURDATA25 GLCDCURDATA25
extern volatile uint32_t   GLCDCURDATA25 __attribute__((section("sfrs"), address(0xBF8EA864)));
typedef struct {
  uint32_t PIXEL615:4;
  uint32_t PIXEL614:4;
  uint32_t PIXEL613:4;
  uint32_t PIXEL612:4;
  uint32_t PIXEL611:4;
  uint32_t PIXEL610:4;
  uint32_t PIXEL69:4;
  uint32_t PIXEL68:4;
} __GLCDCURDATA25bits_t;
extern volatile __GLCDCURDATA25bits_t GLCDCURDATA25bits __asm__ ("GLCDCURDATA25") __attribute__((section("sfrs"), address(0xBF8EA864)));
#define GLCDCURDATA26 GLCDCURDATA26
extern volatile uint32_t   GLCDCURDATA26 __attribute__((section("sfrs"), address(0xBF8EA868)));
typedef struct {
  uint32_t PIXEL623:4;
  uint32_t PIXEL622:4;
  uint32_t PIXEL621:4;
  uint32_t PIXEL620:4;
  uint32_t PIXEL619:4;
  uint32_t PIXEL618:4;
  uint32_t PIXEL617:4;
  uint32_t PIXEL616:4;
} __GLCDCURDATA26bits_t;
extern volatile __GLCDCURDATA26bits_t GLCDCURDATA26bits __asm__ ("GLCDCURDATA26") __attribute__((section("sfrs"), address(0xBF8EA868)));
#define GLCDCURDATA27 GLCDCURDATA27
extern volatile uint32_t   GLCDCURDATA27 __attribute__((section("sfrs"), address(0xBF8EA86C)));
typedef struct {
  uint32_t PIXEL631:4;
  uint32_t PIXEL630:4;
  uint32_t PIXEL629:4;
  uint32_t PIXEL628:4;
  uint32_t PIXEL627:4;
  uint32_t PIXEL626:4;
  uint32_t PIXEL625:4;
  uint32_t PIXEL624:4;
} __GLCDCURDATA27bits_t;
extern volatile __GLCDCURDATA27bits_t GLCDCURDATA27bits __asm__ ("GLCDCURDATA27") __attribute__((section("sfrs"), address(0xBF8EA86C)));
#define GLCDCURDATA28 GLCDCURDATA28
extern volatile uint32_t   GLCDCURDATA28 __attribute__((section("sfrs"), address(0xBF8EA870)));
typedef struct {
  uint32_t PIXEL77:4;
  uint32_t PIXEL76:4;
  uint32_t PIXEL75:4;
  uint32_t PIXEL74:4;
  uint32_t PIXEL73:4;
  uint32_t PIXEL72:4;
  uint32_t PIXEL71:4;
  uint32_t PIXEL70:4;
} __GLCDCURDATA28bits_t;
extern volatile __GLCDCURDATA28bits_t GLCDCURDATA28bits __asm__ ("GLCDCURDATA28") __attribute__((section("sfrs"), address(0xBF8EA870)));
#define GLCDCURDATA29 GLCDCURDATA29
extern volatile uint32_t   GLCDCURDATA29 __attribute__((section("sfrs"), address(0xBF8EA874)));
typedef struct {
  uint32_t PIXEL715:4;
  uint32_t PIXEL714:4;
  uint32_t PIXEL713:4;
  uint32_t PIXEL712:4;
  uint32_t PIXEL711:4;
  uint32_t PIXEL710:4;
  uint32_t PIXEL79:4;
  uint32_t PIXEL78:4;
} __GLCDCURDATA29bits_t;
extern volatile __GLCDCURDATA29bits_t GLCDCURDATA29bits __asm__ ("GLCDCURDATA29") __attribute__((section("sfrs"), address(0xBF8EA874)));
#define GLCDCURDATA30 GLCDCURDATA30
extern volatile uint32_t   GLCDCURDATA30 __attribute__((section("sfrs"), address(0xBF8EA878)));
typedef struct {
  uint32_t PIXEL723:4;
  uint32_t PIXEL722:4;
  uint32_t PIXEL721:4;
  uint32_t PIXEL720:4;
  uint32_t PIXEL719:4;
  uint32_t PIXEL718:4;
  uint32_t PIXEL717:4;
  uint32_t PIXEL716:4;
} __GLCDCURDATA30bits_t;
extern volatile __GLCDCURDATA30bits_t GLCDCURDATA30bits __asm__ ("GLCDCURDATA30") __attribute__((section("sfrs"), address(0xBF8EA878)));
#define GLCDCURDATA31 GLCDCURDATA31
extern volatile uint32_t   GLCDCURDATA31 __attribute__((section("sfrs"), address(0xBF8EA87C)));
typedef struct {
  uint32_t PIXEL731:4;
  uint32_t PIXEL730:4;
  uint32_t PIXEL729:4;
  uint32_t PIXEL728:4;
  uint32_t PIXEL727:4;
  uint32_t PIXEL726:4;
  uint32_t PIXEL725:4;
  uint32_t PIXEL724:4;
} __GLCDCURDATA31bits_t;
extern volatile __GLCDCURDATA31bits_t GLCDCURDATA31bits __asm__ ("GLCDCURDATA31") __attribute__((section("sfrs"), address(0xBF8EA87C)));
#define GLCDCURDATA32 GLCDCURDATA32
extern volatile uint32_t   GLCDCURDATA32 __attribute__((section("sfrs"), address(0xBF8EA880)));
typedef struct {
  uint32_t PIXEL87:4;
  uint32_t PIXEL86:4;
  uint32_t PIXEL85:4;
  uint32_t PIXEL84:4;
  uint32_t PIXEL83:4;
  uint32_t PIXEL82:4;
  uint32_t PIXEL81:4;
  uint32_t PIXEL80:4;
} __GLCDCURDATA32bits_t;
extern volatile __GLCDCURDATA32bits_t GLCDCURDATA32bits __asm__ ("GLCDCURDATA32") __attribute__((section("sfrs"), address(0xBF8EA880)));
#define GLCDCURDATA33 GLCDCURDATA33
extern volatile uint32_t   GLCDCURDATA33 __attribute__((section("sfrs"), address(0xBF8EA884)));
typedef struct {
  uint32_t PIXEL815:4;
  uint32_t PIXEL814:4;
  uint32_t PIXEL813:4;
  uint32_t PIXEL812:4;
  uint32_t PIXEL811:4;
  uint32_t PIXEL810:4;
  uint32_t PIXEL89:4;
  uint32_t PIXEL88:4;
} __GLCDCURDATA33bits_t;
extern volatile __GLCDCURDATA33bits_t GLCDCURDATA33bits __asm__ ("GLCDCURDATA33") __attribute__((section("sfrs"), address(0xBF8EA884)));
#define GLCDCURDATA34 GLCDCURDATA34
extern volatile uint32_t   GLCDCURDATA34 __attribute__((section("sfrs"), address(0xBF8EA888)));
typedef struct {
  uint32_t PIXEL823:4;
  uint32_t PIXEL822:4;
  uint32_t PIXEL821:4;
  uint32_t PIXEL820:4;
  uint32_t PIXEL819:4;
  uint32_t PIXEL818:4;
  uint32_t PIXEL817:4;
  uint32_t PIXEL816:4;
} __GLCDCURDATA34bits_t;
extern volatile __GLCDCURDATA34bits_t GLCDCURDATA34bits __asm__ ("GLCDCURDATA34") __attribute__((section("sfrs"), address(0xBF8EA888)));
#define GLCDCURDATA35 GLCDCURDATA35
extern volatile uint32_t   GLCDCURDATA35 __attribute__((section("sfrs"), address(0xBF8EA88C)));
typedef struct {
  uint32_t PIXEL831:4;
  uint32_t PIXEL830:4;
  uint32_t PIXEL829:4;
  uint32_t PIXEL828:4;
  uint32_t PIXEL827:4;
  uint32_t PIXEL826:4;
  uint32_t PIXEL825:4;
  uint32_t PIXEL824:4;
} __GLCDCURDATA35bits_t;
extern volatile __GLCDCURDATA35bits_t GLCDCURDATA35bits __asm__ ("GLCDCURDATA35") __attribute__((section("sfrs"), address(0xBF8EA88C)));
#define GLCDCURDATA36 GLCDCURDATA36
extern volatile uint32_t   GLCDCURDATA36 __attribute__((section("sfrs"), address(0xBF8EA890)));
typedef struct {
  uint32_t PIXEL97:4;
  uint32_t PIXEL96:4;
  uint32_t PIXEL95:4;
  uint32_t PIXEL94:4;
  uint32_t PIXEL93:4;
  uint32_t PIXEL92:4;
  uint32_t PIXEL91:4;
  uint32_t PIXEL90:4;
} __GLCDCURDATA36bits_t;
