Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/include/proc/p32mz1064dah176.h
#define _IC7CON_ICSIDL_POSITION                  0x0000000D
#define _IC7CON_ICSIDL_MASK                      0x00002000
#define _IC7CON_ICSIDL_LENGTH                    0x00000001

#define _IC7CON_w_POSITION                       0x00000000
#define _IC7CON_w_MASK                           0xFFFFFFFF
#define _IC7CON_w_LENGTH                         0x00000020

#define _IC8CON_ICM_POSITION                     0x00000000
#define _IC8CON_ICM_MASK                         0x00000007
#define _IC8CON_ICM_LENGTH                       0x00000003

#define _IC8CON_ICBNE_POSITION                   0x00000003
#define _IC8CON_ICBNE_MASK                       0x00000008
#define _IC8CON_ICBNE_LENGTH                     0x00000001

#define _IC8CON_ICOV_POSITION                    0x00000004
#define _IC8CON_ICOV_MASK                        0x00000010
#define _IC8CON_ICOV_LENGTH                      0x00000001

#define _IC8CON_ICI_POSITION                     0x00000005
#define _IC8CON_ICI_MASK                         0x00000060
#define _IC8CON_ICI_LENGTH                       0x00000002

#define _IC8CON_ICTMR_POSITION                   0x00000007
#define _IC8CON_ICTMR_MASK                       0x00000080
#define _IC8CON_ICTMR_LENGTH                     0x00000001

#define _IC8CON_C32_POSITION                     0x00000008
#define _IC8CON_C32_MASK                         0x00000100
#define _IC8CON_C32_LENGTH                       0x00000001

#define _IC8CON_FEDGE_POSITION                   0x00000009
#define _IC8CON_FEDGE_MASK                       0x00000200
#define _IC8CON_FEDGE_LENGTH                     0x00000001

#define _IC8CON_SIDL_POSITION                    0x0000000D
#define _IC8CON_SIDL_MASK                        0x00002000
#define _IC8CON_SIDL_LENGTH                      0x00000001

#define _IC8CON_ON_POSITION                      0x0000000F
#define _IC8CON_ON_MASK                          0x00008000
#define _IC8CON_ON_LENGTH                        0x00000001

#define _IC8CON_ICM0_POSITION                    0x00000000
#define _IC8CON_ICM0_MASK                        0x00000001
#define _IC8CON_ICM0_LENGTH                      0x00000001

#define _IC8CON_ICM1_POSITION                    0x00000001
#define _IC8CON_ICM1_MASK                        0x00000002
#define _IC8CON_ICM1_LENGTH                      0x00000001

#define _IC8CON_ICM2_POSITION                    0x00000002
#define _IC8CON_ICM2_MASK                        0x00000004
#define _IC8CON_ICM2_LENGTH                      0x00000001

#define _IC8CON_ICI0_POSITION                    0x00000005
#define _IC8CON_ICI0_MASK                        0x00000020
#define _IC8CON_ICI0_LENGTH                      0x00000001

#define _IC8CON_ICI1_POSITION                    0x00000006
#define _IC8CON_ICI1_MASK                        0x00000040
#define _IC8CON_ICI1_LENGTH                      0x00000001

#define _IC8CON_ICSIDL_POSITION                  0x0000000D
#define _IC8CON_ICSIDL_MASK                      0x00002000
#define _IC8CON_ICSIDL_LENGTH                    0x00000001

#define _IC8CON_w_POSITION                       0x00000000
#define _IC8CON_w_MASK                           0xFFFFFFFF
#define _IC8CON_w_LENGTH                         0x00000020

#define _IC9CON_ICM_POSITION                     0x00000000
#define _IC9CON_ICM_MASK                         0x00000007
#define _IC9CON_ICM_LENGTH                       0x00000003

#define _IC9CON_ICBNE_POSITION                   0x00000003
#define _IC9CON_ICBNE_MASK                       0x00000008
#define _IC9CON_ICBNE_LENGTH                     0x00000001

#define _IC9CON_ICOV_POSITION                    0x00000004
#define _IC9CON_ICOV_MASK                        0x00000010
#define _IC9CON_ICOV_LENGTH                      0x00000001

#define _IC9CON_ICI_POSITION                     0x00000005
#define _IC9CON_ICI_MASK                         0x00000060
#define _IC9CON_ICI_LENGTH                       0x00000002

#define _IC9CON_ICTMR_POSITION                   0x00000007
#define _IC9CON_ICTMR_MASK                       0x00000080
#define _IC9CON_ICTMR_LENGTH                     0x00000001

#define _IC9CON_C32_POSITION                     0x00000008
#define _IC9CON_C32_MASK                         0x00000100
#define _IC9CON_C32_LENGTH                       0x00000001

#define _IC9CON_FEDGE_POSITION                   0x00000009
#define _IC9CON_FEDGE_MASK                       0x00000200
#define _IC9CON_FEDGE_LENGTH                     0x00000001

#define _IC9CON_SIDL_POSITION                    0x0000000D
#define _IC9CON_SIDL_MASK                        0x00002000
#define _IC9CON_SIDL_LENGTH                      0x00000001

#define _IC9CON_ON_POSITION                      0x0000000F
#define _IC9CON_ON_MASK                          0x00008000
#define _IC9CON_ON_LENGTH                        0x00000001

#define _IC9CON_ICM0_POSITION                    0x00000000
#define _IC9CON_ICM0_MASK                        0x00000001
#define _IC9CON_ICM0_LENGTH                      0x00000001

#define _IC9CON_ICM1_POSITION                    0x00000001
#define _IC9CON_ICM1_MASK                        0x00000002
#define _IC9CON_ICM1_LENGTH                      0x00000001

#define _IC9CON_ICM2_POSITION                    0x00000002
#define _IC9CON_ICM2_MASK                        0x00000004
#define _IC9CON_ICM2_LENGTH                      0x00000001

#define _IC9CON_ICI0_POSITION                    0x00000005
#define _IC9CON_ICI0_MASK                        0x00000020
#define _IC9CON_ICI0_LENGTH                      0x00000001

#define _IC9CON_ICI1_POSITION                    0x00000006
#define _IC9CON_ICI1_MASK                        0x00000040
#define _IC9CON_ICI1_LENGTH                      0x00000001

#define _IC9CON_ICSIDL_POSITION                  0x0000000D
#define _IC9CON_ICSIDL_MASK                      0x00002000
#define _IC9CON_ICSIDL_LENGTH                    0x00000001

#define _IC9CON_w_POSITION                       0x00000000
#define _IC9CON_w_MASK                           0xFFFFFFFF
#define _IC9CON_w_LENGTH                         0x00000020

#define _OC1CON_OCM_POSITION                     0x00000000
#define _OC1CON_OCM_MASK                         0x00000007
#define _OC1CON_OCM_LENGTH                       0x00000003

#define _OC1CON_OCTSEL_POSITION                  0x00000003
#define _OC1CON_OCTSEL_MASK                      0x00000008
#define _OC1CON_OCTSEL_LENGTH                    0x00000001

